package com.sergey.evaluator;

/**
 * Определяет типы лексем (токенов), на которые разбивается математическое выражение
 *
 * @author Белявцев Сергей
 * @version 1.0
 */
public enum TokenType {
    /** Число, например, 3.14 или 42 */
    NUMBER,
    /** Оператор, например, +, *, / */
    OPERATOR,
    /** Переменная, например, x, myVar */
    VARIABLE,
    /** Функция, например, sin, sqrt */
    FUNCTION,
    /** Левая (открывающая) скобка */
    LEFT_PAREN,
    /** Правая (закрывающая) скобка */
    RIGHT_PAREN
}
